[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:25:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="orgCode">orgCode</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-orgCode"}
-                        id="orgCode"
-                        type="text"
-                        {...register("orgCode")}
-                        value={initialContents.orgCode}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: UCSBOrganizationForm tests renders correctly when passing in a UCSBOrganization
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgCode/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:25:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="orgCode">orgCode</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-orgCode"}
-                        id="orgCode"
-                        type="text"
-                        {...register("orgCode")}
-                        value={initialContents.orgCode}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: UCSBOrganizationForm tests renders correctly when passing in a UCSBOrganization
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgCode/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
