[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:45:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="orgTranslationShort">orgTranslationShort</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-orgTranslationShort"}
+                    data-testid={testIdPrefix + ""}
                     id="orgTranslationShort"
                     type="text"
killedBy: UCSBOrganizationForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgTranslationShort"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:77:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="inactive">inactive</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-inactive"}
+                    data-testid={testIdPrefix + ""}
                     id="inactive"
                     as="select"
killedBy: UCSBOrganizationForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationForm-inactive"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:81:46
                     id="inactive"
                     as="select"
                     isInvalid={Boolean(errors.inactive)}
-                    {...register("inactive", {
-                        required: "inactive is required."
-                    })}
+                    {...register("inactive", {})}
                 >
                 <option value="">Select</option>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:81:34
                     id="inactive"
                     as="select"
                     isInvalid={Boolean(errors.inactive)}
-                    {...register("inactive", {
+                    {...register("", {
                         required: "inactive is required."
                     })}
killedBy: UCSBOrganizationForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
