[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:7:63
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBOrganizationCreatePage({storybook=false}) {
+export default function UCSBOrganizationCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (ucsborganization) => ({
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsborganization"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-     orgCode: ucsborganization.orgCode,
-     orgTranslationShort: ucsborganization.orgTranslationShort,
-     orgTranslation: ucsborganization.orgTranslation,
-     inactive: ucsborganization.inactive,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:11:13
 
   const objectToAxiosParams = (ucsborganization) => ({
     url: "/api/ucsborganization/post",
-    method: "POST",
+    method: "",
     params: {
      orgCode: ucsborganization.orgCode,
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:12:13
   const objectToAxiosParams = (ucsborganization) => ({
     url: "/api/ucsborganization/post",
     method: "POST",
-    params: {
-     orgCode: ucsborganization.orgCode,
-     orgTranslationShort: ucsborganization.orgTranslationShort,
-     orgTranslation: ucsborganization.orgTranslation,
-     inactive: ucsborganization.inactive,
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": "false",
-   "orgCode": "ZPR",
