[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:3:53
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBOrganizationIndexPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/ucsborganization/create">Create</a></p>
-        <p><a href="/ucsborganization/edit/1">Edit</a></p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBOrganizationIndexPage() {}
killedBy: UCSBOrganizationIndexPage tests Renders expected content
statusReason: Error: UCSBOrganizationIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
