[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-     orgTranslationShort: ucsborganization.orgTranslationShort,
-     orgTranslation: ucsborganization.orgTranslation,
-     inactive: ucsborganization.inactive,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:12:13
   const objectToAxiosParams = (ucsborganization) => ({
     url: "/api/ucsborganization/post",
     method: "POST",
-    params: {
-     orgTranslationShort: ucsborganization.orgTranslationShort,
-     orgTranslation: ucsborganization.orgTranslation,
-     inactive: ucsborganization.inactive,
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "inactive": "false",
-   "orgTranslation": "ZETA PHI RHO",

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:43
     }
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(`New ucsborganization Created - orgCode: ${ucsborganization.orgCode} orgTranslationShort: ${ucsborganization.orgTranslationShort}`);
-  }
+  const onSuccess = (ucsborganization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsborganization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:11
   });
 
   const onSuccess = (ucsborganization) => {
-    toast(`New ucsborganization Created - orgCode: ${ucsborganization.orgCode} orgTranslationShort: ${ucsborganization.orgTranslationShort}`);
+    toast(``);
   }
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsborganization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO"
Received: ""

Number of calls: 1
