[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:25:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsborganization) => ({
-        url: "/api/ucsborganization",
-        method: "PUT",
-        params: {
-            orgCode: ucsborganization.orgCode,
-        },
-        data: {
-            orgCode: ucsborganization.orgCode,
-            orgTranslationShort: ucsborganization.orgTranslationShort,
-            orgTranslation: ucsborganization.orgTranslation,
-            inactive: ucsborganization.inactive
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHO FRAT orgTranslation: ZETA PHI RHO FRATERNITY inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:31:15
         params: {
             orgCode: ucsborganization.orgCode,
         },
-        data: {
-            orgCode: ucsborganization.orgCode,
-            orgTranslationShort: ucsborganization.orgTranslationShort,
-            orgTranslation: ucsborganization.orgTranslation,
-            inactive: ucsborganization.inactive
-        }
+        data: {}
     });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgCode\":\"ZPR\",\"orgTranslationShort\":\"ZETA PHI RHO FRAT\",\"orgTranslation\":\"ZETA PHI RHO FRATERNITY\",\"inactive\":\"false\"}"
Received: "{}"
