[Killed] Regex
main/components/MenuItemReviews/MenuItemReviewForm.js:25:24
    // Stryker disable next-line Regex
    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
    
-   const email_regex = /^\S+@\S+\.\S+$/;
+   const email_regex = /^\S+@\S\.\S+$/;
    const stars_regex = /^[1-5]$/;
 
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] Regex
main/components/MenuItemReviews/MenuItemReviewForm.js:25:24
    // Stryker disable next-line Regex
    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
    
-   const email_regex = /^\S+@\S+\.\S+$/;
+   const email_regex = /^\s+@\S+\.\S+$/;
    const stars_regex = /^[1-5]$/;
 
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:35:14
 
          <Row>
 
-            {initialContents && (
-               <Col>
-                  <Form.Group className="mb-3" >
-                     <Form.Label htmlFor="id">Id</Form.Label>
-                     <Form.Control
-                        data-testid="MenuItemReviewForm-id"
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                     />
-                  </Form.Group>
-               </Col>
-            )}
+            {initialContents || <Col>
+                  <Form.Group className="mb-3">
+                     <Form.Label htmlFor="id">Id</Form.Label>
+                     <Form.Control data-testid="MenuItemReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                  </Form.Group>
+               </Col>}
 
             <Col>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:59:57
                      id="itemId"
                      type="text"
                      isInvalid={Boolean(errors.itemId)}
-                     {...register("itemId", { required: true,})}
+                     {...register("itemId", { required: false,})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /ItemID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:62:23
                      {...register("itemId", { required: true,})}
                   />
                   <Form.Control.Feedback type="invalid">
-                     {errors.itemId && 'ItemID is required.'}
+                     {errors.itemId || 'ItemID is required.'}
                   </Form.Control.Feedback>
                </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:77:23
                      {...register("reviewerEmail", { required: true, pattern: email_regex})}
                   />
                   <Form.Control.Feedback type="invalid">
-                     {errors.reviewerEmail && 'ReviewerEmail is required.'}
+                     {true}
                   </Form.Control.Feedback>
                </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /ReviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:89:56
                      id="stars"
                      type="number"
                      isInvalid={Boolean(errors.stars)}
-                     {...register("stars", { required: true, pattern: stars_regex})}
+                     {...register("stars", { required: false, pattern: stars_regex})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:89:44
                      id="stars"
                      type="number"
                      isInvalid={Boolean(errors.stars)}
-                     {...register("stars", { required: true, pattern: stars_regex})}
+                     {...register("stars", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:104:35
                      id="dateReviewed"
                      type="datetime-local"
                      isInvalid={Boolean(errors.dateReviewed)}
-                     {...register("dateReviewed", { required: true, pattern: isodate_regex })}
+                     {...register("", { required: true, pattern: isodate_regex })}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:119:59
                      id="comments"
                      type="text"
                      isInvalid={Boolean(errors.comments)}
-                     {...register("comments", { required: true, })}
+                     {...register("comments", { required: false, })}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:122:23
                      {...register("comments", { required: true, })}
                   />
                   <Form.Control.Feedback type="invalid">
-                     {errors.comments && 'Comments is required.'}
+                     {true}
                   </Form.Control.Feedback>
                </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
