[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:35:7
          Header: 'id',
          accessor: 'id', // accessor is the "key" in the data
       },
-      {
-         Header: 'ItemId',
-         accessor: 'itemId',
-      },
+      {},
       {
          Header: 'ReviewerEmail',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:65:15
    return <OurTable
       data={menuItemReviews}
       columns={columns}
-      testid={"MenuItemReviewsTable"}
+      testid={""}
    />;
 };
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
