[Survived] BlockStatement
src/main/utils/MenuItemReviewUtils.js:8:47
    toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-   return {
-      url: "/api/menuitemReview",
-      method: "DELETE",
-      params: {
-         id: cell.row.values.id
-      }
-   }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 

[Survived] ObjectLiteral
src/main/utils/MenuItemReviewUtils.js:9:11
 }
 
 export function cellToAxiosParamsDelete(cell) {
-   return {
-      url: "/api/menuitemReview",
-      method: "DELETE",
-      params: {
-         id: cell.row.values.id
-      }
-   }
+   return {}
 }
 

[Survived] StringLiteral
src/main/utils/MenuItemReviewUtils.js:10:12
 
 export function cellToAxiosParamsDelete(cell) {
    return {
-      url: "/api/menuitemReview",
+      url: "",
       method: "DELETE",
       params: {
