[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:60:35
                      id="itemId"
                      type="text"
                      isInvalid={Boolean(errors.itemId)}
-                     {...register("itemId", { required: true,})}
+                     {...register("", { required: true,})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:76:64
                      type="text"
                      isInvalid={Boolean(errors.reviewerEmail)}
                      // {...register("reviewerEmail", { required: true, pattern: email_regex})}
-                     {...register("reviewerEmail", { required: true, })}
+                     {...register("reviewerEmail", { required: false, })}
 
                   />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /ReviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:76:52
                      type="text"
                      isInvalid={Boolean(errors.reviewerEmail)}
                      // {...register("reviewerEmail", { required: true, pattern: email_regex})}
-                     {...register("reviewerEmail", { required: true, })}
+                     {...register("reviewerEmail", {})}
 
                   />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /ReviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:93:56
                      type="number"
                      isInvalid={Boolean(errors.stars)}
                      // {...register("stars", { required: true, pattern: stars_regex})}
-                     {...register("stars", { required: true, })}
+                     {...register("stars", { required: false, })}
 
                   />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:124:35
                      id="comments"
                      type="text"
                      isInvalid={Boolean(errors.comments)}
-                     {...register("comments", { required: true, })}
+                     {...register("", { required: true, })}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
