[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:40:20
 
       {
          Header: "ItemId", 
-         accessor: "itemId"
+         accessor: ""
       },
       {
killedBy: MenuItemReviewsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-itemId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
