[Killed] ObjectLiteral
src/main/utils/MenuItemReviewUtils.js:9:11
 }
 
 export function cellToAxiosParamsDelete(cell) {
-   return {
-      url: "/api/menuitemreview",
-      method: "DELETE",
-      params: {
-         id: cell.row.values.id
-      }
-   }
+   return {}
 }
killedBy: MenuItemReviewUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {
